B8Ng/STM32_Ambient_temperature_monitoring/NET/MqttKit.c
/*************************************可变头部***********************************************/
	
	//可变头部----------------------pkt_id长度-----------------------------------------------
	mqttPacket->_data[mqttPacket->_len++] = pkt_id >> 8;
	mqttPacket->_data[mqttPacket->_len++] = pkt_id & 0xff;
	
	return 0;

}


uint1 MQTT_UnPacketPublishRel(uint8 *rev_data, uint16 pkt_id)
{

	if(rev_data[1] != 2)
		return 1;

	if(rev_data[2] == MOSQ_MSB(pkt_id) && rev_data[3] == MOSQ_LSB(pkt_id))
		return 0;
	else
		return 1;

}


uint1 MQTT_PacketPublishComp(uint16 pkt_id, MQTT_PACKET_STRUCTURE *mqttPacket)
{

	MQTT_NewBuffer(mqttPacket, 4);
	if(mqttPacket->_data == NULL)
		return 1;
	
/*************************************固定头部***********************************************/
	
	//固定头部----------------------头部消息-------------------------------------------------
	mqttPacket->_data[mqttPacket->_len++] = MQTT_PKT_PUBCOMP << 4;
	
	//固定头部----------------------剩余长度-------------------------------------------------
	mqttPacket->_data[mqttPacket->_len++] = 2;
	
/*************************************可变头部***********************************************/
	
	//可变头部----------------------pkt_id长度-----------------------------------------------
	mqttPacket->_data[mqttPacket->_len++] = pkt_id >> 8;
	mqttPacket->_data[mqttPacket->_len++] = pkt_id & 0xff;
	
	return 0;

}


uint1 MQTT_UnPacketPublishComp(uint8 *rev_data)
{

	if(rev_data[1] != 2)
		return 1;

	if(rev_data[2] == MOSQ_MSB(MQTT_PUBLISH_ID) && rev_data[3] == MOSQ_LSB(MQTT_PUBLISH_ID))
		return 0;
	else
		return 1;

}


uint1 MQTT_PacketPing(MQTT_PACKET_STRUCTURE *mqttPacket)
{

	MQTT_NewBuffer(mqttPacket, 2);
	if(mqttPacket->_data == NULL)
		return 1;
	
/*************************************固定头部***********************************************/
	
	//固定头部----------------------头部消息-------------------------------------------------
	mqttPacket->_data[mqttPacket->_len++] = MQTT_PKT_PINGREQ << 4;
	
	//固定头部----------------------剩余长度-------------------------------------------------
	mqttPacket->_data[mqttPacket->_len++] = 0;
	
	return 0;

}

void MQTT_Ping(void)
{
	uint8 *dataPtr;
	MQTT_PACKET_STRUCTURE mqttPacket = {NULL, 0, 0, 0};
	if(MQTT_PacketPing(&mqttPacket)==0)
	{
		ESP8266_SendData(mqttPacket._data,mqttPacket._len);//发送心跳包
		printf("发送出心跳包！\r\n");
		MQTT_DeleteBuffer(&mqttPacket);//删包
		dataPtr=ESP8266_GetIPD(100);//等待平台响应
		if(dataPtr!=NULL)
		{
			OneNet_RevPro(dataPtr);//解析数据(平台操作单片机功能)
			if(MQTT_UnPacketRecv(dataPtr) == MQTT_PKT_PINGRESP)
			{
				ESP8266_Clear();									//清空缓存
				printf("Ping成功\r\n");
			}
			else
			{
				printf("Ping失败\r\n");
				printf("重新初始化ESP8266\r\n");
				ESP8266_Init();	
				printf("连接Onenet服务器中......\r\n");
				while(ESP8266_SendCmd(ESP8266_ONENET_INFO, "CONNECT"))
					delay_ms(500);
				printf("连接Onenet服务器成功！\r\n");
				while(OneNet_DevLink())//连接Onenet服务器
				{
					delay_ms(500);
				}
				OneNET_Subscribe();//订阅主题
				printf("重新连接Onenet成功\r\n");
			}
		}
	}
}

